Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/boards.txt
menu.01_AutoUploadMode=* Auto Flash Mode
menu.02_UploadBaudrate=* Upload Speed
menu.03_EraseFlash=* Erase All Flash Memory (16MB)
menu.04_CameraOption=* Camera Options
menu.05_FCSMode=* Camera FCS Mode
menu.06_LoadNNModelSource=* NN Model Load From
menu.07_OTAMode=* OTA Mode
menu.08_StdLibInit=* Standard Lib
menu.09_Ard_logs=* Arduino: API logs
menu.10_system_mm_logs=* System: Multimedia logs
menu.11_system_wifi_logs=* System: WiFi logs
menu.12_all_logs=* All logs: Hard mute
menu.13_Watchdog=* Watchdog

### menu.14_CompliationMode=* Compiling Mode

##############################################################
# PLEASE DO NOT PUT BOARDS ABOVE THE OFFICIAL AMEBA BOARDS! ##
##############################################################

Ameba_AMB82-MINI.name=AMB82-MINI
#Ameba_AMB82-MINI.vid.0=0x1A86
#Ameba_AMB82-MINI.pid.0=0x7523

Ameba_AMB82-MINI.build.tarch=Arm-v8M
Ameba_AMB82-MINI.build.mcu=RTL8735B
Ameba_AMB82-MINI.build.f_cpu=500000000L
Ameba_AMB82-MINI.build.usb_product="AMB82-MINI"
Ameba_AMB82-MINI.build.board=AMEBA
Ameba_AMB82-MINI.build.core=ambpro2
Ameba_AMB82-MINI.build.extra_flags=-DARDUINO_SDK -DARDUINO_AMBPRO2 -DCORE_RTL8735B -DBOARD_AMB82_MINI {build.usb_flags} {build.menu_flags}
Ameba_AMB82-MINI.build.ldscript=linker_scripts/gcc/amebapro2_ram_arduino.ld
Ameba_AMB82-MINI.build.variant=ameba_amb82-mini

Ameba_AMB82-MINI.build.menu_flags={build.Arduino_STD_PRINTF_flags} {build.Arduino_LOAD_MODEL_flags} {build.ota_mode_flags} {build.fcs_mode_flags} {build.show_arduino_logs_flags} {build.show_mm_logs_flags} {build.show_wifi_logs_flags} {build.hardmute_logs_flags} {build.watchdog_flags} {build.sensor_flags}
### {build.compile_mode_flag}

Ameba_AMB82-MINI.upload.tool=ameba_pro2_tools
Ameba_AMB82-MINI.upload.protocol=usb_serial
Ameba_AMB82-MINI.upload.maximum_size=16777216
Ameba_AMB82-MINI.upload.use_1200bps_touch=false
Ameba_AMB82-MINI.upload.wait_for_upload_port=false
Ameba_AMB82-MINI.upload.native_usb=false
Ameba_AMB82-MINI.upload.auto_mode=Disable
Ameba_AMB82-MINI.upload.erase_flash=Disable
Ameba_AMB82-MINI.upload.speed=2000000

Ameba_AMB82-MINI.menu.01_AutoUploadMode.Disable=Disable
Ameba_AMB82-MINI.menu.01_AutoUploadMode.Disable.upload.auto_mode=Disable
Ameba_AMB82-MINI.menu.01_AutoUploadMode.Enable=Enable
Ameba_AMB82-MINI.menu.01_AutoUploadMode.Enable.upload.auto_mode=Enable

Ameba_AMB82-MINI.menu.02_UploadBaudrate.2M=2000000
Ameba_AMB82-MINI.menu.02_UploadBaudrate.2M.upload.speed=2000000
Ameba_AMB82-MINI.menu.02_UploadBaudrate.1M=1000000
Ameba_AMB82-MINI.menu.02_UploadBaudrate.1M.upload.speed=1000000
Ameba_AMB82-MINI.menu.02_UploadBaudrate.230400=230400
Ameba_AMB82-MINI.menu.02_UploadBaudrate.230400.upload.speed=230400

Ameba_AMB82-MINI.menu.03_EraseFlash.Disable=Disable
Ameba_AMB82-MINI.menu.03_EraseFlash.Disable.upload.erase_flash=Disable
Ameba_AMB82-MINI.menu.03_EraseFlash.Enable=Erase only
Ameba_AMB82-MINI.menu.03_EraseFlash.Enable.upload.erase_flash=Enable
Ameba_AMB82-MINI.menu.03_EraseFlash.EnableUpload=Erase then Upload
Ameba_AMB82-MINI.menu.03_EraseFlash.EnableUpload.upload.erase_flash=Enable_Upload

Ameba_AMB82-MINI.menu.04_CameraOption.f37=JXF37
Ameba_AMB82-MINI.menu.04_CameraOption.f37.build.camera_opt=SENSOR_F37
Ameba_AMB82-MINI.menu.04_CameraOption.f37.build.sensor_flags=-DARDUINO_SENSOR_F37
Ameba_AMB82-MINI.menu.04_CameraOption.f53=JXF53
Ameba_AMB82-MINI.menu.04_CameraOption.f53.build.camera_opt=SENSOR_F53
Ameba_AMB82-MINI.menu.04_CameraOption.f53.build.sensor_flags=-DARDUINO_SENSOR_F53
Ameba_AMB82-MINI.menu.04_CameraOption.gc2053=GC2053
Ameba_AMB82-MINI.menu.04_CameraOption.gc2053.build.camera_opt=SENSOR_GC2053
Ameba_AMB82-MINI.menu.04_CameraOption.gc2053.build.sensor_flags=-DARDUINO_SENSOR_GC2053
Ameba_AMB82-MINI.menu.04_CameraOption.gc4653=GC4653
Ameba_AMB82-MINI.menu.04_CameraOption.gc4653.build.camera_opt=SENSOR_GC4653
Ameba_AMB82-MINI.menu.04_CameraOption.gc4653.build.sensor_flags=-DARDUINO_SENSOR_GC4653
Ameba_AMB82-MINI.menu.04_CameraOption.gc4663=GC4663
Ameba_AMB82-MINI.menu.04_CameraOption.gc4663.build.camera_opt=SENSOR_GC4663
Ameba_AMB82-MINI.menu.04_CameraOption.gc4663.build.sensor_flags=-DARDUINO_SENSOR_GC4663
Ameba_AMB82-MINI.menu.04_CameraOption.gc5035=GC5035
Ameba_AMB82-MINI.menu.04_CameraOption.gc5035.build.camera_opt=SENSOR_GC5035
Ameba_AMB82-MINI.menu.04_CameraOption.gc5035.build.sensor_flags=-DARDUINO_SENSOR_GC5035
Ameba_AMB82-MINI.menu.04_CameraOption.imx307=IMX307
Ameba_AMB82-MINI.menu.04_CameraOption.imx307.build.camera_opt=SENSOR_IMX307
Ameba_AMB82-MINI.menu.04_CameraOption.imx307.build.sensor_flags=-DARDUINO_SENSOR_IMX307
Ameba_AMB82-MINI.menu.04_CameraOption.imx327=IMX327
Ameba_AMB82-MINI.menu.04_CameraOption.imx327.build.camera_opt=SENSOR_IMX327
Ameba_AMB82-MINI.menu.04_CameraOption.imx327.build.sensor_flags=-DARDUINO_SENSOR_IMX327
Ameba_AMB82-MINI.menu.04_CameraOption.imx662=IMX662
Ameba_AMB82-MINI.menu.04_CameraOption.imx662.build.camera_opt=SENSOR_IMX662
Ameba_AMB82-MINI.menu.04_CameraOption.imx662.build.sensor_flags=-DARDUINO_SENSOR_IMX662
Ameba_AMB82-MINI.menu.04_CameraOption.imx681=IMX681
Ameba_AMB82-MINI.menu.04_CameraOption.imx681.build.camera_opt=SENSOR_IMX681
Ameba_AMB82-MINI.menu.04_CameraOption.imx681.build.sensor_flags=-DARDUINO_SENSOR_IMX681
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_5m=IMX681_5M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_5m.build.camera_opt=SENSOR_IMX681_5M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_5m.build.sensor_flags=-DARDUINO_SENSOR_IMX681_5M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_12m=IMX681_12M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_12m.build.camera_opt=SENSOR_IMX681_12M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_12m.build.sensor_flags=-DARDUINO_SENSOR_IMX681_12M
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_12m_seq=IMX681_12M_SEQ
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_12m_seq.build.camera_opt=SENSOR_IMX681_12M_SEQ
Ameba_AMB82-MINI.menu.04_CameraOption.imx681_12m_seq.build.sensor_flags=-DARDUINO_SENSOR_IMX681_12M_SEQ
Ameba_AMB82-MINI.menu.04_CameraOption.k306p=K306P
Ameba_AMB82-MINI.menu.04_CameraOption.k306p.build.camera_opt=SENSOR_K306P
Ameba_AMB82-MINI.menu.04_CameraOption.k306p.build.sensor_flags=-DARDUINO_SENSOR_K306P
Ameba_AMB82-MINI.menu.04_CameraOption.k306p_hd=K306P_HD
Ameba_AMB82-MINI.menu.04_CameraOption.k306p_hd.build.camera_opt=SENSOR_K306P_HD
Ameba_AMB82-MINI.menu.04_CameraOption.k306p_hd.build.sensor_flags=-DARDUINO_SENSOR_K306P_HD
Ameba_AMB82-MINI.menu.04_CameraOption.ov50a40=OV50A40
Ameba_AMB82-MINI.menu.04_CameraOption.ov50a40.build.camera_opt=SENSOR_OV50A40
Ameba_AMB82-MINI.menu.04_CameraOption.ov50a40.build.sensor_flags=-DARDUINO_SENSOR_OV50A40
Ameba_AMB82-MINI.menu.04_CameraOption.ov50a40_50m=OV50A40_50M
Ameba_AMB82-MINI.menu.04_CameraOption.ov50a40_50m.build.camera_opt=SENSOR_OV50A40_50M
Ameba_AMB82-MINI.menu.04_CameraOption.ov50a40_50m.build.sensor_flags=-DARDUINO_SENSOR_OV50A40_50M
Ameba_AMB82-MINI.menu.04_CameraOption.ov5647=OV5647
Ameba_AMB82-MINI.menu.04_CameraOption.ov5647.build.camera_opt=SENSOR_OV5647
Ameba_AMB82-MINI.menu.04_CameraOption.ov5647.build.sensor_flags=-DARDUINO_SENSOR_OV5647
Ameba_AMB82-MINI.menu.04_CameraOption.ov9734=OV9734
Ameba_AMB82-MINI.menu.04_CameraOption.ov9734.build.camera_opt=SENSOR_OV9734
Ameba_AMB82-MINI.menu.04_CameraOption.ov9734.build.sensor_flags=-DARDUINO_SENSOR_OV9734
Ameba_AMB82-MINI.menu.04_CameraOption.ov9734_sd=OV9734_SD
Ameba_AMB82-MINI.menu.04_CameraOption.ov9ov9734_sd734.build.camera_opt=SENSOR_OV9734_SD
Ameba_AMB82-MINI.menu.04_CameraOption.ov9ov9734_sd734.build.sensor_flags=-DARDUINO_SENSOR_OV9734_SD
Ameba_AMB82-MINI.menu.04_CameraOption.ps5268=PS5268
Ameba_AMB82-MINI.menu.04_CameraOption.ps5268.build.camera_opt=SENSOR_PS5268
Ameba_AMB82-MINI.menu.04_CameraOption.ps5268.build.sensor_flags=-DARDUINO_SENSOR_PS5268
Ameba_AMB82-MINI.menu.04_CameraOption.sc2336=SC2336
Ameba_AMB82-MINI.menu.04_CameraOption.sc2336.build.camera_opt=SENSOR_SC2336
Ameba_AMB82-MINI.menu.04_CameraOption.sc2336.build.sensor_flags=-DARDUINO_SENSOR_SC2336
Ameba_AMB82-MINI.menu.04_CameraOption.fixp_2k=FIXP_2K
Ameba_AMB82-MINI.menu.04_CameraOption.fixp_2k.build.camera_opt=SENSOR_FIXP_2K
Ameba_AMB82-MINI.menu.04_CameraOption.fixp_2k.build.sensor_flags=-DARDUINO_SENSOR_FIXP_2K
Ameba_AMB82-MINI.menu.04_CameraOption.fixp_5m=FIXP_5M
Ameba_AMB82-MINI.menu.04_CameraOption.fixp_5m.build.camera_opt=SENSOR_FIXP_5M
Ameba_AMB82-MINI.menu.04_CameraOption.fixp_5m.build.sensor_flags=-DARDUINO_SENSOR_FIXP_5M

Ameba_AMB82-MINI.menu.05_FCSMode.Disable=Disable
Ameba_AMB82-MINI.menu.05_FCSMode.Disable.build.fcs_mode_val=Disable
Ameba_AMB82-MINI.menu.05_FCSMode.Disable.build.fcs_mode_flags=
Ameba_AMB82-MINI.menu.05_FCSMode.Enable=Enable
Ameba_AMB82-MINI.menu.05_FCSMode.Enable.build.fcs_mode_val=Enable
Ameba_AMB82-MINI.menu.05_FCSMode.Enable.build.fcs_mode_flags=-DArduino_FCS_MODE

Ameba_AMB82-MINI.menu.06_LoadNNModelSource.flash=Flash
Ameba_AMB82-MINI.menu.06_LoadNNModelSource.flash.build.Arduino_LOAD_MODEL_flags=-DArduino_LOAD_MODEL_FLASH
Ameba_AMB82-MINI.menu.06_LoadNNModelSource.flash.build.model_src=LoadFromFlash
Ameba_AMB82-MINI.menu.06_LoadNNModelSource.sd=SD Card
Ameba_AMB82-MINI.menu.06_LoadNNModelSource.sd.build.Arduino_LOAD_MODEL_flags=-DArduino_LOAD_MODEL_SD
Ameba_AMB82-MINI.menu.06_LoadNNModelSource.sd.build.model_src=LoadFromSD

Ameba_AMB82-MINI.menu.07_OTAMode.Disable=Disable
Ameba_AMB82-MINI.menu.07_OTAMode.Disable.build.ota_mode_val=Disable
Ameba_AMB82-MINI.menu.07_OTAMode.Disable.build.ota_mode_flags=
Ameba_AMB82-MINI.menu.07_OTAMode.Enable=Enable
Ameba_AMB82-MINI.menu.07_OTAMode.Enable.build.ota_mode_val=Enable
Ameba_AMB82-MINI.menu.07_OTAMode.Enable.build.ota_mode_flags=-DArduino_OTA_MODE

Ameba_AMB82-MINI.menu.08_StdLibInit.Enable=Arduino_STD_PRINTF
Ameba_AMB82-MINI.menu.08_StdLibInit.Enable.build.Arduino_STD_PRINTF_flags=-DArduino_STD_PRINTF
Ameba_AMB82-MINI.menu.08_StdLibInit.Disable=Disable
Ameba_AMB82-MINI.menu.08_StdLibInit.Disable.build.Arduino_STD_PRINTF_flags=

